title: "Generic CLI abuse"
id: "SIG-CLI-PARTIAL-1"
status: test
logsource:
  category: process_creation

detection:
  selection:
    EventID: 4688
    CommandLine: "*cmd*"
  condition: selection

level: medium
