title: "Detection - Malicious CMD Example"
id: "SIG-CLI-PASS-1"
level: medium
description: "Detects command line activity involving cmd.exe"
status: experimental
author: "SOC Team"
date: 2025-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine: "*cmd.exe*"
  condition: selection
falsepositives:
  - Legitimate administrative tasks
level: medium
tags:
  - attack.execution
  - attack.t1059.003
