title: Neutral Rule - SYSTEM Malicious Execution
id: SIG-90040
status: experimental
description: Matches malicious process creation executed specifically by SYSTEM, giving a moderate number of detections.
logsource:
  product: windows

detection:
  selection:
    EventID: 4688
    CommandLine|contains: "malicious"
    User: "SYSTEM"
  condition: selection

falsepositives:
  - system automated tasks
level: medium
